Revit 2024 API
TransmissionData.DocumentIsNotTransmitted Method
 Determines whether the document at a given file location is not transmitted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool DocumentIsNotTransmitted(
	ModelPath filePath
)
Visual Basic
Public Shared Function DocumentIsNotTransmitted ( _
	filePath As ModelPath _
) As Boolean
Visual C++
public:
static bool DocumentIsNotTransmitted(
	ModelPath^ filePath
)
Parameters
filePath
Type: Autodesk.Revit.DB.ModelPath
 The path to the document whose transmitted state will be checked.
Return Value
 False if the document is a transmitted file, true otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TransmissionData Class
Autodesk.Revit.DB Namespace